-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 22, 2024 at 08:00 AM
-- Server version: 10.4.22-MariaDB
-- PHP Version: 8.0.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `el-masria-group`
--

-- --------------------------------------------------------

--
-- Table structure for table `client_user`
--

CREATE TABLE `client_user` (
  `id` int(18) NOT NULL,
  `national_ID` varchar(14) NOT NULL,
  `full_name` varchar(250) NOT NULL,
  `email` varchar(250) NOT NULL,
  `phone_number` varchar(11) NOT NULL,
  `phone_number _2` varchar(250) NOT NULL,
  `phone_number _3` varchar(250) NOT NULL,
  `land_line_1` varchar(250) NOT NULL,
  `land_line_2` varchar(250) NOT NULL,
  `land_line_3` varchar(250) NOT NULL,
  `HasLawProcedures` varchar(250) NOT NULL,
  `TypeAchievePersonal` varchar(250) NOT NULL,
  `reg_status` enum('registered','not registered','in progress') NOT NULL DEFAULT 'not registered'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `client_user`
--

INSERT INTO `client_user` (`id`, `national_ID`, `full_name`, `email`, `phone_number`, `phone_number _2`, `phone_number _3`, `land_line_1`, `land_line_2`, `land_line_3`, `HasLawProcedures`, `TypeAchievePersonal`, `reg_status`) VALUES
(1, '12345678912345', 'ahmed mohamed ahmed1', 'ahmed.mohamed.ahmed1@email.com', '01093001070', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(2, '12345678912378', 'ahmed mohamed ahmed2', 'ahmed.mohamed.ahmed2@email.com', '01093001070', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(16235, '27507230103983', 'اميمه على ابراهيم على الشرقاوى', '', '01228532088', '', '', '25185384', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(16239, '27909280100188', 'اميره محمود صالح صالح', 'A@a.a', '01006793254', '', '', '23910208', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(16290, '1249478', 'كامل بن ابراهيم بن محمد السليمانى', 'ت', '00966548555', '', '', '00966566816618', '', '', 'false', 'جواز سفر', 'not registered'),
(16423, '', 'احمد محمد احمد ابو نيده', '0', '01007709942', '01001638188', '', '24901698', '01142710640', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17139, '28507092102958', 'حسام الدين كامل محمد على', '1', '01227005403', '01002156320', '', '35617127', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17168, '26206240101144', 'زينب خليل ابراهيم مجاهد', '@', '01006035334', '', '', '22822535', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17219, '27807111701132', 'حمدى محروس احمد جلال', 'ب', '01143454077', '', '', '048/3941095', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17264, '28408168800121', 'ولاء محمد محمد الكتاتنى', 'f', '01222590366', '', '', '33869471', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(17313, '27008081200214', 'ضياء احمد كمال احمد الحديدى', 'ك', '01004770229', '', '', '24540427', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(17369, '28911042103193', 'محمد احمد اسماعيل ابو رحاب', 'd', '', '', '', '34710471', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17383, '27101180103859', 'طارق  اسماعيل ابو رحاب عارف', 'g', '01007901191', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17456, '28906250100331', 'محمد امام محمد عيسى', 'ل', '01114515927', '01117597747', '', '22460686', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17498, '28110162300771', 'محمد اسماعيل عبد الحليم اسماعيل', 'ي', '01004986122', '011225794922', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17663, '27712310101879', 'محمود حسين محمود عبد المجيد', 'س', '01150942481', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(17832, '28309020102264', 'بسمه مصطفى كامل الامام', 'لا يوجد', '01222482087', '', '', '25196545', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(18750, '29106232100895', 'احمد محمود صالح صالح محمد', 'ams.eng@hotmail.com', '01007562154', '01550625251', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18757, '28107040100835', 'معتنز فاروق محمود فهمى الشافعى', 'moutaz_120@yahoo.com', '01001899247', '', '', '01114019996', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18766, '28802201803459', 'عادل محمد مختار ابو زيد', 'aabozeid@eg-bank.com', '01203808472', '01224114322', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18773, '29401070101959', 'جرجس وجدى بشرى عبد الله', 'gerges_baushra@yahoo.com', '01009441692', '01128498824', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18776, '28704090100745', 'ميادة نبيل محمد ابراهيم بدوى', 'mayada_nabil@yahoo.com', '01283663639', '01002628876', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18799, '27104298800111', 'وحيد محمد عبد الحميد البدرى', 'ف', '', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18801, '25909032600711', 'احمد محمود عطيه', 'j', '01223140484', '01061704800', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18805, '28702090102931', 'احمد رضا عبد الرحمن حجازى', 'ahmed.reda.hegazy@gmail.com', '01000569383', '01122615999', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(18817, '29004260100089', 'ايه احمد سيد حسين', 'bazzoka2020@gmail.com', '01095958335', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19006, '7410735', 'مارجريت مارى فالى', '3', '01005402559', '', '', '', '', '', 'false', 'جواز سفر', 'not registered'),
(19142, '28102112100914', 'احمد فؤاد صبحى امين', 'N/A', '01092395434', '00966590222515', '00966596950848', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19184, '27008270100298', 'اشرف انور هاشم ابو العلا', 'ا', '01010222400', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19222, '28503151602671', 'امير عبد الحميد مصطفى الدرف', 'ث', '01004564790', '', '', '0233848292', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19265, '29101192702232', 'محمد فهيم بكرى محمد', 'لا', '01206622241', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19330, '28201012126337', 'احمد رمضان حسين بشندى', 'ن', '01094000440', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19338, '27312178800233', 'شهاب الدين محمد محمود حديوى', 'k', '01224109193', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19397, '27711102301299', 'فتحى شعبان اسماعيل حسين', 'fathyallam@yahoo.com', '01090201643', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19450, '28003012100081', 'نها عطارد على اسعد خليل', 'lulucaty80@gmail.com', '01003358888', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19451, '27911300104791', 'اسلام ابراهيم عبد القتاح يونس', 'labdelfatab@sib.com', '01119255518', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19455, '29606220101295', 'كريم عماد مقار ارمانيوس', 'business.char22@gmail.com', '01212769856', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19457, '29410082500637', 'جرجس عبد الملاك يعقوب جرجس', 'girgis.engineer@gmail.com', '01275589431', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19462, '27301032400878', 'باسم صمؤئيل عجيب اسحق', 'basem', '01004005148', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19464, '28909041601799', 'محمد احمد محمد على', 'mohamed.ahmed.aly.@gmail.com', '01090160465', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19465, '28210262200698', 'اشرف ممدوح عويس محمد', 'fupla82@gmail.com', '01091843251', '01271277244', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19466, '28100914010135', 'مصطفى ابراهيم خليل حامد', 'mostafakhalel@gmail.com', '01000940970', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19467, '28103312100478', 'مصطفى انور ابو الفتوح بيومى', 'medhatanwar48@gmail.com', '01225406612', '01272667732', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19468, '28510178800519', 'اسلام احمد فتحى عباس احمد برايه', 'eng.eslam_baraya@yahoo.com', '01201144475', '01005445376', '01011929997', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19469, '28409191402236', 'عماد حمدى عبد الرازق على هيكل', 'emadheikel@gmail.com', '01123548443', '01009757381', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19470, '28411250104915', 'محمد مختار سعد فهيم حفنى', 'mohamed.hefny@rub.de', '01101412403', '01283878975', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19472, '28810178800318', 'حلمى عبد النبى حلمى احمد', 'لا يوجد اميل', '01143263526', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19473, '29711270100492', 'محمد كرم محمد محمد على', 'mohamed.karam9797@gmail.com', '01005536197', '01003975581', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19477, '29408152101773', 'احمد شكرى محمد ابراهيم الكردى', 'AHMEDELKORDY1994@GMAIL.COM', '01143014528', '01090086788', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19479, '29008181303972', 'محمد حمدى محمد محمد', 'm.khateeer@gmail.com', '01069636797', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19481, '28610080102991', 'مينا مجدى ابراهيم رزق', 'minamagdydolavs@yahoo.com', '01229733910', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19482, '29811142600835', 'مينا نشأت جرجس شنوده', 'mario.nashat@orascom.com', '01272277350', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19483, '29709250106384', 'عبيراحمد محمود عطيه احمد', 'غ', '01223140484', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19486, '29703132103259', 'عبد الله احمد عبد العزيز احمد', 'abdallahmad174@gmail.com', '01065942507', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19488, '27208190101799', 'حسن على مراد على', 'v', '01006282553', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19489, '28202050100135', 'سامح محمد حامد عبد الغنى', 'samehmohamed983@gmail.com', '01061919334', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19490, '27811290103703', 'نرفين على توفيق محمد', 'foud02397@gmail.com', '01006228485', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19491, '26305212700138', 'سيد محمد على محمود', 'ق', '01120168050', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19495, '27811212401901', 'مروة شداد توفيق احمد', 'dis22018@hotmail.com', '01002667373', '01113383299', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19496, '29508042100814', 'محمد صفاء عبد الباقى بليطى', 'mohamedsafaa203@gmail..com', '01068811331', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19503, '27501252104811', 'القس صمؤئيل بالميلاد / ماجد فوزى فرج جرجس', 'fr.samuel.fawzy@gmail.com', '01275606460', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19506, '28208172102587', 'حنان ابراهيم محمد ابراهيم هزاع', 'hananhazaa.hh@gmail.com', '01007878119', '01005089875', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19507, '27511030100618', 'ايمن نبيل محمد رفاعى', 'ayman.rifae@gmail.com', '01006271876', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19508, '27810301700516', 'طلعت مشحوت حامد محمد', 'talaat-mashhout@elarabygroup.com', '01272669942', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19510, '28411080104567', 'ندا صابر صالح احمد', 'amr72012@yahoo.com', '01100870006', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19511, '29408092101639', 'عمرو محى الدين احمد محمد منصور', 'mohyamr@gmail.com', '01154034782', '01090411373', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19512, '29306198800415', 'محمد اسامة صادق مصطفى', 'mohamed.osama9888@gmail.com', '01091767662', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19513, '28009102100151', 'هانى عبد العزيز نصر عبد العزيز', 'hany_nasr_it@hotmail.com', '01009024141', '01091205081', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19514, '29109020101718', 'مؤمن يوسف حسن محمود', 'moumen.yousef91@gmail.com', '01093826608', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19515, '29304118800328', 'تسنيم يحيى عبد الفتاح مصطفى', 'amryahia304@gmail.com', '01005461983', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19516, '29703012601719', 'خالد رمضان فهمى فرغلى', 'kledramadan2222422@gmail.com', '01096482632', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19519, '29105122101826', 'اسماء حسن حسين نبوى', 'لا يوجد ميل', '01153203300', '0115358399', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19520, '28306190101913', 'احمد محمود محمد حموده', 'لم  يحضر العميل وقت الحجز', '01090076167', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19527, '29808172102715', 'محمد عيد حسن عبد الله', 'memoaed07@gmail.com', '01145097815', '01150091182', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19528, '28509211800394', 'احمد سعد السيد تفاحة', 'dr,ahmedsaad8@gmail.com', '01143440088', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19530, '30009270109986', 'سهيلة احمد محمد عبد الهادى', 'sohilaabdelhady974@gmail.com', '01029372611', '0122868348', '01099775474', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19533, '30011012103014', 'يوسف خالد عبد الحفيظ شتات', 'khaled.hafeez@gmail.com', '01223706309', '01100357624', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19535, '29207050102192', 'حسام يحيى كامل مصطفى', 'sounds0pain@gmail.com', '01022994625', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19536, '29210271300437', 'محمد طاهر يوسف على', 'mohamedtaher@gmail.com', '01093289456', '01000166245', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19537, '29712072102605', 'هاجر محمود محمد يوسف شحاته', 'thepicker07@gmail.com', '01006835912', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19538, '29304268800199', 'علاء الدين محمد جلال جمعه الباسوسى', 'alaaeldeen.galal@azhar.edu.eg', '01116964030', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19540, '29607230106798', 'عزت سعيد عبد الفتاح محمد', 'zer70280@gmail.com', '01061775981', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19541, '28304250101222', 'نجوى ابراهيم سيد ابو العلا', 'halawa2015.ah@gmail.com', '01289150983', '01100270290', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19546, '29208071600318', 'احمد انس السيد دبا', 'ahmedanas04@gmail.com', '01027179576', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19549, '27906102103913', 'حسن محمد سيد احمد ابوزيد', 'hassanb_2006@yahoo.com', '01090966032', '00971558284015', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19551, '28511232103221', 'ساره على رفعت احمد الملط', 'لا يود', '0101171550', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19552, '28408152200204', 'شيرين سامى غبريال عوض', 'shery2003.sa@gmail/com', '01222758180', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19555, '28204252103058', 'تامر شاكر محمد خطاب', 't-khattab82@yahoo.com', '01226762139', '0097433818597', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19556, '29204040100284', 'منى مدحت مرسى عوض مرسى', 'monamedhat604@gmail.com', '01145277009', '01007804197', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19560, '29307232401173', 'طارق بدرمحمد عبدالمطلب', 'غير متوفر', '01156993470', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19561, '27206071401005', 'هناء محمد عبد الحافظ عباس', 'hassin.zani@wamderfactory.eg.com', '01018045457', '', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19564, '28405011207249', 'نشوى ابراهيم محمد عبد الهادى', 'sharkawy509@gmail.com', '01009480768', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19565, '27112060103547', 'عبير فاروق عبد الرحيم اسماعيل', 'abeeresmail71@gmail.com', '0100823691', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19566, '28011040103918', 'هانى شحات مسعود بشاى', 'eng_hany.shahat2005@hotmail.com', '01222612761', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19567, '28004070102391', 'احمد محمد مصطفى الشيخ', 'aelsheakh2@gmail.com', '01128282232', '01002399208', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19568, '28311031301051', 'مشعل احمد حلمى بيومى', 'adammishu@gmail.com', '01068199661', '01550275581', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19569, '27406102500375', 'مصطفى رفعت رشدى عبد الحكيم', 'تم الحجز بالموقع', '01111141852', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19570, '30105290101205', 'فرح سعيد محمد محمد', 'fs0340733@gmail.com', '01013380458', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19572, '27811230103721', 'شيماء صلاح عبد العزيز شعبان مطاوع', 'mazeneyes81@gmail.com', '01000689904', '01205517930', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19573, '27209300103675', 'محمد ابراهيم محمد سعد', 'elabbasymohamed@yahoo.com', '01104559698', '01104559689', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19574, '28912250102563', 'فاطمه ممدوح تامر ابراهيم', 'm.tamed@elbaraka.com.eg', '01112375552', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19575, '29308012112738', 'عماد فرج الله زاكى بشاى قرياقص', 'emad.f.z@gmail.com', '01210339885', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19576, '28901072105454', 'مينا ماهر امين ساوريرس', 'mina.maher.amin@gmail.com', '01212500820', '01158040011', '01002133311', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19577, '27109171700861', 'هدى عبد الله مصطفى محمد', 'mohamedeldahshanis19932GMAIL.COM', '01066732588', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19580, '28408010103465', 'عزه ابراهيم حسين عثمان', 'mostafa.badawy97@yahoo.com', '01121182119', '01006070272', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19582, '28209061202198', 'شعبان سيد احمد محمد محمد المدابغى', 'shaabansaid363@gmail.com', '01274158350', '01112114532', '01102850552', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19583, '28911062103548', 'باسنت بدرى محمود عبد اللطيف', 'hamadosman@gmail.com', '01016123333', '01030915430', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19584, '29107020101359', 'احمد احمد محمود محمد ابراهيم', 'a7medx2@outlook.com', '01000037062', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19585, '27901140100438', 'محمود كمال عزيز احمد صالح', 'm_k_alqabas@yahoo.com', '01097522993', '', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19586, '29203142602803', 'رشا محمود عبد الرحمن محمد', 'rasha_amaar80@yahoo.com', '01025305622', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19593, '27501072200951', 'نافع محمد احمد حسن', 'الحجز بالموقع', '01124222591', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19594, '30107022700972', 'جورج محارب فخرى غالى', 'gogoking69@yahoo.com', '01006462094', '', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19599, '28706241300094', 'احمد عبد المنعم محمد رخا الضوى', 'eldawyimaging@gmail.com', '01004513343', '01091405890', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19601, '29605042404878', 'سامر مجدى عزيز سعد', 'samermagdy10@gmail.com', '01274234027', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19604, '27201061600563', 'سحر جمال الدين محمد الشاعر', 'abdalrhmn200011@gmail.com', '01114881747', '', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19608, '28909201204023', 'سمر السيد محمد محمود الشيوى', 'لايوجد', '01009779100', '01013841859', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19609, '29507201500032', 'سعد محمد ابراهيم عبد الكريم', 'saadm7625@gmail.com', '01062328373', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19612, '26612130101414', 'وائل محمد محمد سلوت', 'waelsaloot1312@gmail.com', '01271744880', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19614, '29508022103396', 'نادر محمد مسعد محمد درويش', 'nadermohamed0003331@gmail.com', '0111933285', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19618, '28903012107019', 'محمد طلعت عبد الرحمن على على', 'mohamed.talaat.malik89@gmail.com', '01114709277', '01114709262', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19619, '29412012102092', 'هشام بهنساوى محمد عبد العال', 'hbhnsawg@gmail.com', '01119178429', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19624, '29406110103374', 'مصطفى محمد السيد السيد يوسف', 'mostafaelprans881@yahoo.com', '01128808163', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19625, '27709110102772', 'محمد السباعى عبد الصمد على', 'fegoroelsebai@gmail.com', '01020236267', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19626, '28605280100034', 'مايكل مكرم ميلاد صليب', 'micael.makram86@yahoo.com', '01281243687', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19628, '27101150103994', 'مصطفى ابو الفتح محمد مصطفى', 'mo2595171@gmail.com', '01029969118', '01558988806', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19630, '29201022102511', 'احمد كمال عبد العزيز احمد منطاش', 'montash24@gmail.com', '01020412358', '01007723941', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19632, '28603132800296', 'محمود محمد السيد حسين', 'mahmoud.elsayad.198633@gmail.com', '01111290126', '01003835350', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19636, '28804070103831', 'محمد على احمد خليل', 'mohamed.ali.khalil88@gmail.com', '01020765350', '01016111758', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19640, '28311180102745', 'رضوى حسن ابراهيم الدقرنى', 'doctor_radwa@yahoo.com', '01009644174', '01094192552', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19641, '28306031500173', 'احمد شريف سعد احمد بلتاجى', 'unqssupplies@gmail.com', '01112348000', '01115757525', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19647, '29006140101076', 'عمرو احمد محمد السيد احمد', 'amr.ahmed19990@gmail.com', '01557796653', '01555513334', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19648, '29610318800652', 'احمد عاطف عبد الرؤف عبد الباقى', 'hawary555@yahoo.com', '01005664968', '01006214371', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19652, '27406202102156', 'البرنس عبد السلام عبد الوهاب', 'elprince674@yahoo.com', '01275653087', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19654, '26904028800121', 'سمر مصطفى وهبى محمد مصطفى', 'swhbi69@gmail.com', '01064635248', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19656, '29408052401672', 'عبد الرحمن عاطف سعيد سليمان', 'rohaiem3640@gmail.com', '01090500098', '01204111112', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19657, '29003270101788', 'ريم مجدى محمد احمد', 'engscep.adel@GMAIL.COM', '01068746234', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19658, '29204270103077', 'محمد محسن انور عثمان', 'mo7mmed_mo7sen666@outlook', '01025508889', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19660, '29601202601556', 'كريم محمد سعد الدين عبد العال', 'KAREEMSAAD530@GMAIL.COM', '01097147306', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19663, '29309300108601', 'ايه علاء الدين زينهم بسيونى', 'aya.alaa401@gmail.com', '01094220713', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19668, '29310142102054', 'محمد خليل اسماعيل محمد', 'بالحجز الموقع', '01016668136', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19671, '30003112101334', 'محمد خالد سلطان عبده على', 'م', '01158202798', '', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19672, '30002190101336', 'مصطفى محمد عصام الدين محمد', 'mostafaayad67@gmail.com', '01140699726', '01289915172', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19674, '29501012112198', 'اسامه محمد على على احمد جعفر', 'osa822@yahoo.com', '01121975505', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19676, '29401011600399', 'احمد على السيد الطحان', 'ahmedtahan1994@gmail.com', '01155561176', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19685, '29802202104698', 'عبد الرحمن محمد طارق على الدين محمد', 'abdelrhmantarek38@yahoo.com', '01050002326', '01112111446', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19686, '29311051400814', 'محمود احمد عبد العزيز احمد', 'matwa@aloula-eg.com', '01128601197', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19687, '29701252100871', 'احمد حسنى كمال جابرى', 'dabryahmed@gmail.com', '01117055011', '01000778516', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19688, '29310010114258', 'محمد احمد سيد عبد المنعم', 'mm.omara12@gmail.com', '01100392612', '01012012867', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19689, '29602030101234', 'احمد عاطف محمد محمد عيسى', 'ahmed.atef321996@gmail.com', '01014615667', '01123009578', '01006833967', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19696, '28007250103671', 'محمد سعيد عبد العاطى خليفه', 'mohamedsaid1102010@yahoo.com', '01016377008', '01555504851', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19699, '29609022103613', 'دافيد منير ناشد ابراهيم سليمان', 'mariambahnan982@gmail.com', '01286028111', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19700, '29102152102913', 'جرجس عبد المسيح عياد مسعود', 'joeelashkar2@gmail.com', '01012518081', '01020500793', '01020500794', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19707, '29605081700123', 'وئام ايمن عبد المنعم حمامه', 'loay.hamame@yaho..o.com', '01028682340', '01201531061', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19708, '28408120103479', 'تامر محمد زين العابدين عبد العظيم', 'tamer_zin@gmail.com', '‏‪0114 857 ', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19709, '29612070102492', 'مازن جمال محمود حسن مصطفى', 'mahmoudwakil89@gmail.com', '01019129421', '01279806755', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19710, '28407261201648', 'وفاء فكرى ابراهيم عبد العال', 'wafaa.fikry@yaoo.com', '01000775562', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19712, '29702252100095', 'وليد ماجد حسين محمد', 'walidmaged1132@gmail.com', '01114955419', '01009972621', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19713, '28607060103779', 'محمود محمد محمد حسن', 'mhmodi@amazon.com', '01050521004', '01007778133', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19716, '29601030100118', 'محمد عماد محمود كمال عبد الحميد', 'mohamedkhatib@cibeg.com', '01001070684', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19717, '29511260102293', 'عمر طه محمد على محمد', 'omaralitaha@gmail.com', '01157760019', '01005743757', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19718, '28705092100757', 'هشام انور عبد العزيز محمود', 'hisham.anwar.officiad@gmail.com', '01005588456', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19723, '28303132100754', 'محمد انور عبد العزيز محمود', 'm_anwar_133@yahoo.com', '01208863389', '01006759976', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19726, '29102140101539', 'اشرف اسعد خالد المصرى', 'ashraf.asaad.91@gmail.com', '01114084922', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19728, '29304292100858', 'محمد اسامه محمد بدر', 'mohamed.osama.badrr@gmail.com', '01096997832', '01281553524', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19729, '29401270101694', 'احمد محمود احمد التونى عمر', 'ahmedeltoony5@gmail.com', '01203514051', '01050311580', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19738, '28408232600319', 'حمدى احمد محمد محمود', 'doctorhamdy1984@yahoo.com', '01002730268', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19739, '27507302600499', 'محمد صلاح عبد العزيز عقل', 'avocatoonline11@gmail.com', '01007196789', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19744, '28705290103036', 'احمد محمد مختار معوض هاشم', 'ahmedmokhtar87@gmail.com', '01117999534', '01117999507', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19746, '28609152107234', 'مينا ديمترى هنرى جورجى', 'minadmitry@yahoo.com', '01201409274', '01274573771', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19747, '29408152101757', 'علاء شكرى محمد ابراهيم الكردى', 'alaa.elkordy815@gmail.com', '01124371262', '0109305796', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19753, '27102242102494', 'احمد محمد ابو القاسم مصطفى محمد', 'a.yahia779@gmail.com', '01023353371', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19766, '29304112102394', 'احمد هشام ابراهيم محمد ابو العينين', 'ahmed-hesham-10@yahoo.com', '01221407039', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19782, '27605232101696', 'طارق صلاح محمد حسين رشوان', 'tarek.3131@gmail.com', '01112343331', '01112280301', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19783, '29909148800151', 'يوسف عماد بليغ ريحان', 'emady73@yahoo.com', '01015545733', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19794, '29205071600599', 'محمد محمود محمد رمضان', 'desmohamedramadan2017@gmail.com', '01063271146', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19795, '29510298800273', 'احمد مجدى احمد ابراهيم جبريل', 'ahmedjebril1995@gmail.com', '01020379731', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19801, '28903232102531', 'محمد فتحى على حسن احمد', 'm_faehii@ymail.com', '01125467333', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19802, '28603160103053', 'احمد عبد الفتاح محمد احمد', 'al3mbokertuv14@gmail.com', '01281732073', '01060720068', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19804, '2930730010496', 'ياسر صلاح الدين فتحى نجيب', 'balozahh@gmail.com', '01156601118', '01092224991', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19811, '29610010105953', 'حسن كمال حسن محمد الجيار', 'hassankamalhassan@gmail.com', '01228572616', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19820, '27801010103511', 'عمرو عبد الرؤف محمد توفيق', 'amroffaa@gmail.com', '01000102876', '01015115148', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19827, '29512012106131', 'محمد حنفى عبد الله احمد', 'mohamed.hanfi61@gmail.com', '01120350232', '01065250402', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19830, '28606298800251', 'حسام الدين خضر عبد العزيز خضر', 'hossamkhedr78@yahoo.com', '01201885796', '01024242872', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19831, '29809282104876', 'خالد محمد متولى عامر', 'khaledamer998@gmail.com', '01148401062', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19838, '29409010111654', 'محمد هانى عبد العزيز محمد', 'eng.mohamed.hany@gmail.com', '01112611970', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19840, '29510012104593', 'جاسر عبد الستار ابو الغيط بخيت', 'eng>gasserabdelsattar@hot,mail.com', '01024021246', '01554431376', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19842, '29705160201374', 'اسلام سمير محمد عبد الرحيم', 'islam000sanir@gmail.com', '01116363580', '01009407557', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19846, '28207300100812', 'محمد اسامه احمد ضيف', 'biovisionegypt@gmail.com', '01060003018', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19849, '29301042101973', 'محمود سعيد الصاوى عبد الحميد', 'الحجز باالموقع', '01110007971', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19856, '30306250103995', 'سيف الدين وليد محمد حمدان محمد', 'saifwalleed7@gmail.com', '01155010019', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19858, '29902112301235', 'محمد طه محمد ابراهيم', 'mohamedtahaomk@gmail.com', '01099230105', '01111392984', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19861, '30204102103679', 'عبد الرحمن محمد عطا محمود', 'abdomohamed2688938@gmail.com', '01009307283', '01150481472', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19867, '29403282100653', 'احمد محمد ابو الفتوح محمد بدر', 'gin9912@gmail.com', '01099750447', '01117771541', '', '', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(19869, '29305130101229', 'هدير محمد رضوان احمد', 'hadeerradwan342@yahoo.com', '01003107302', '00966530899376', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19882, '29802158800878', 'محمد ابراهيم عبد الرحمن محمد الشافعى', 'ش', '01097526532', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19890, '29104062100396', 'احمد سمير ربيع محمد حسن', 'ahmedstito0o@gmail.com', '01118115513', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19891, '29405250105192', 'محمد نصر الدين محمد محمد على', 'mohamed_ix@icloud.com', '01119280393', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19893, '29210268800038', 'مصطفى سامى مصطفى احمد مهنى', 'mostafakasralainy@gmail.com', '01111497578', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19903, '29809211203563', 'نجلاء مجاهد محمد عبد الرحيم حسانين', 'naglaamegahed17@gmail.com', '01551741383', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19922, '27602291201778', 'جهاد زغلول ابراهيم سليم جريشة', 'بي', '01228458772', '01092064472', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19940, '29904251501217', 'عمر محمد عاطف على محمد', 'chande0m0@gmail.com', '01005308643', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19942, '29003102104933', 'محمد عربى فرج سيد', 'الحجزبالموقع', '01154023767', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(19969, '28001251601552', 'عبد الهادى السيد عبد الهادى عبد المعطى', 'ئ', '01151992898', '01006433916', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20036, '28605182103297', 'محمود محمد السعدى عويس علم الدين', 'ح', '01143150878', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20044, '27709150108269', 'امانى محمد محيى الدين عبد الوهاب', 'كم', '01157263936', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20048, '27010040100552', 'جمال احمد صالح محمد ماهر', 'ط', '01006068713', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20080, '27909070105896', 'محمد ياسين محمد احمد', 'يي', '01284840066', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20082, '27003181301091', 'جبر عواد حسن حسن', 'ص', '0100606035', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20138, '29011090102347', 'مونيكا اشرف فارس طانيوس', 'د', '01227590224', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20148, '27807082800819', 'رامى محمد عزت عبد الوارث عثمان', 'سي', '01090762876', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20190, '28802100107796', 'مينا عزيز لبيب عزيز', 'mina.aziz.labib@gmail.com', '01026664446', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20193, '28203210103728', 'ايلارية عزت لبيب عزيز', 'mkdkddd', '', '', '', '01150007578', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20213, '27202140103202', 'هاله عاطف احمد على', 'بببب', '', '', '', '01006939240', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20354, '29109151403728', 'مادونا وصفي سيف تادرس', 's', '', '', '', '01205646626', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20491, '27508152100031', 'حازم حلمى صادق حسن على', '00', '', '', '', '00', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20496, '28811092700872', 'محمد جمال محمد محمد', 'ة', '01153468696', '', '', '01094233001', '', '', 'true', 'بطاقة الرقم القومي', 'not registered'),
(20719, '29604141300654', 'احمد ابراهيم احميد عبد الرحيم', 'ahmedebrahim332211@gmail.com', '01098694420', '0112117700', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20736, '29607108800896', 'ياسين عبد المنعم عطيه السيد بحيرى', 'yaseenbehairy@gmail.com', '01094621422', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20741, '27304071803601', 'غاده عبد المنعم عبد المقصود شبانه', 'ghada.shabana@gmail.com', '00971528404', '', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(20758, '29511038800373', 'هشام صلاح عبد الفتاح موسى', 'heshammosa95@eng.asu.edu.eg', '01015675468', '01004013801', '', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(21253, '28408210100177', 'حازم عبدالرحمن صالح الشبراوى', 'mezoan218@gmail.com', '01030317715', '0018329236114', '0018327049477', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(21444, '28302081400735', 'حلمى مجدى ابراهيم معوض', '01027345191', '00971586421', '00971586421688', '01009487347', '', '', '', 'false', 'بطاقة الرقم القومي', 'not registered'),
(21958, 'ِِِA25708754', 'فاطمه محمود عبدالجليل فخرالدين ', 'fakhraldeenfatemah@gmail.com', '00971566665', '00971568753382', '', '', '', '', 'false', 'جواز سفر', 'not registered');

-- --------------------------------------------------------

--
-- Table structure for table `gui_lanuage`
--

CREATE TABLE `gui_lanuage` (
  `id` int(11) NOT NULL,
  `lang` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `gui_lanuage`
--

INSERT INTO `gui_lanuage` (`id`, `lang`) VALUES
(1, 'en'),
(2, 'ar');

-- --------------------------------------------------------

--
-- Table structure for table `gui_theme`
--

CREATE TABLE `gui_theme` (
  `id` int(11) NOT NULL,
  `theme` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `gui_theme`
--

INSERT INTO `gui_theme` (`id`, `theme`) VALUES
(1, 'dark'),
(2, 'white');

-- --------------------------------------------------------

--
-- Table structure for table `leaveamessage`
--

CREATE TABLE `leaveamessage` (
  `id` int(11) NOT NULL,
  `companyId` varchar(250) NOT NULL,
  `extensionNumber` varchar(250) NOT NULL,
  `extensionName` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `leaveamessage`
--

INSERT INTO `leaveamessage` (`id`, `companyId`, `extensionNumber`, `extensionName`) VALUES
(1, '134', '7951', 'El Masreen Leave a message');

-- --------------------------------------------------------

--
-- Table structure for table `module_menu`
--

CREATE TABLE `module_menu` (
  `id` varchar(250) NOT NULL,
  `id_parent` varchar(250) DEFAULT NULL,
  `icon` varchar(250) NOT NULL,
  `link` varchar(250) DEFAULT NULL,
  `name` varchar(250) NOT NULL,
  `type` enum('tab','men') NOT NULL DEFAULT 'tab',
  `order_no` int(11) NOT NULL,
  `level` int(18) NOT NULL,
  `nahtta_order` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `module_menu`
--

INSERT INTO `module_menu` (`id`, `id_parent`, `icon`, `link`, `name`, `type`, `order_no`, `level`, `nahtta_order`) VALUES
('Access Denied', NULL, '', 'index?module=Access_Denied', 'Access Denied', 'tab', 4, 0, 4),
('Blocked Users', 'Security', 'mdi mdi-server-remove', 'index?module=Blocked_Users', 'Blocked Users', 'tab', 1, 2, 51),
('Change language', 'Setting', 'fa fa-language', 'index?module=Change_Language', 'Change language', 'tab', 6, 1, 38),
('Change Password', 'Setting', 'mdi mdi-account-key', 'index?module=Change_Password ', 'Change Password', 'tab', 3, 1, 35),
('Change Profile Image', 'Setting', 'mdi mdi-account-card-details', 'index?module=Change_Profile_Image', 'Change Profile Image', 'tab', 2, 1, 34),
('Change theme', 'Setting', 'mdi mdi-theme-light-dark', 'index?module=Change_Theme', 'Change theme', 'tab', 5, 1, 37),
('Client Registration', 'System Administration', 'mdi mdi-account-convert', 'index?module=Client_Registration', 'Client Registration', 'tab', 1, 1, 43),
('Commission System', NULL, 'mdi mdi-calculator', '#', 'Commission System', 'men', 10, 0, 19),
('Configuration', 'Commission System', 'mdi mdi-settings', NULL, 'Configuration', 'men', 3, 1, 25),
('Dashboard', NULL, 'mdi mdi-gauge', 'index?module=home', 'Dashboard', 'tab', 5, 0, 5),
('Dues', 'Payment Reports', 'mdi mdi-calendar-clock', 'index?module=Dues', 'Dues', 'tab', 2, 1, 14),
('Employee Commission', 'Commission System', 'mdi mdi-square-inc-cash', 'index?module=Employee_Commission', 'Employee Commission', 'tab', 1, 1, 21),
('log Management', 'Setting', 'mdi mdi-account-multiple-outline', 'index?module=log_Management', 'log Management', 'tab', 1, 1, 33),
('Login History', 'Setting', 'mdi mdi-account-convert', 'index?module=Login_History', 'Login History', 'tab', 0, 1, 32),
('Manage Extensions Profile', 'Setting', 'mdi mdi-account-settings-variant', 'index?module=Manage_Extensions_Profile', 'Manage Extensions Profile', 'tab', 4, 1, 36),
('Paid Values', 'Payment Reports', 'mdi mdi-calendar-check', 'index?module=Paid_Values', 'Paid Values', 'tab', 1, 1, 13),
('Payment Reports', NULL, 'mdi mdi-calendar-text', '#', 'Payment Reports', 'men', 8, 0, 11),
('Reset User Password', 'Security', 'mdi mdi-account-key', 'index?module=Reset_User_Password', 'Reset User Password', 'tab', 0, 2, 61),
('Review Payments', 'Payment Reports', 'mdi mdi-calendar', 'index?module=Review_Payments', 'Review Payments', 'tab', 0, 1, 12),
('Security', 'System Administration', 'mdi mdi-security', '#', 'Security', 'men', 3, 1, 50),
('Setting', NULL, 'mdi mdi-settings', '#', 'Setting', 'men', 11, 0, 31),
('Sold Units', 'Commission System', 'mdi mdi-home', 'index?module=Sold_Units', 'Sold Units', 'tab', 0, 1, 20),
('Support', NULL, 'mdi mdi-animation', '#', 'Support', 'men', 9, 0, 15),
('System Administration', NULL, 'mdi mdi-camera-front-variant', '#', 'System Administration', 'tab', 12, 0, 42),
('Tickets', 'Support', 'mdi mdi-ticket-account', 'index?module=Tickets', 'Tickets', 'tab', 0, 1, 16),
('User Management', 'System Administration', 'mdi mdi-account-multiple', 'index?module=User_Management', 'User Management', 'tab', 0, 1, 46),
('Users Activity Logs', 'Security', 'mdi mdi-account-convert', 'index?module=Users_Activity_Logs', 'Users Activity Logs', 'tab', 2, 2, 62);

-- --------------------------------------------------------

--
-- Table structure for table `support_tickets`
--

CREATE TABLE `support_tickets` (
  `id` int(11) NOT NULL,
  `ticket_type` enum('Request','Complaint','inquiry') NOT NULL,
  `client_id` varchar(250) NOT NULL,
  `user_input` varchar(250) NOT NULL,
  `Project_Name` varchar(250) NOT NULL,
  `unit_number` varchar(250) NOT NULL,
  `building_name` varchar(250) NOT NULL,
  `ticket_status` varchar(250) NOT NULL,
  `support_input` text NOT NULL,
  `created_by` varchar(250) NOT NULL,
  `creation_date` datetime NOT NULL,
  `contact_number` varchar(250) NOT NULL,
  `last_update_date` datetime NOT NULL,
  `ast_update_by` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `support_tickets`
--

INSERT INTO `support_tickets` (`id`, `ticket_type`, `client_id`, `user_input`, `Project_Name`, `unit_number`, `building_name`, `ticket_status`, `support_input`, `created_by`, `creation_date`, `contact_number`, `last_update_date`, `ast_update_by`) VALUES
(1, 'Complaint', '1', 'Dr Zinab has a bad impression today as she laughed loudly today at her work looks like she working at a night club and sadly her coworker Hend had more loud voice than her and off course she will be grounded for that, i forget to say something her vo', 'Zinab failed to absorb ', '010930010', 'El3ezba el\'3arbya', 'open ', '', 'Muhammad.elnahtta', '2024-05-15 11:00:09', '01093001070', '2024-05-15 11:00:09', ''),
(2, 'Request', '1', 'Dr Zinab has a bad impression today as she laughed loudly today at her work looks like she working at a night club and sadly her coworker Hend had more loud voice than her and off course she will be grounded for that, i forget to say something her vo', 'Zinab failed to absorb ', '010930010', 'El3ezba el\'3arbya', 'open ', '', 'Muhammad.elnahtta', '2024-05-15 11:00:09', '01093001070', '2024-05-15 11:00:09', ''),
(3, 'Request', '20758', 'kindly i need your advice', 'Zinab failed to absorb ', '010930010', 'El3ezba el3arbya', 'open ', '', 'Muhammad.elnahtta', '2024-05-15 11:00:09', '01093001070', '2024-05-15 11:00:09', ''),
(4, 'Request', '1', 'kindly i need your advice', 'Zinab failed to absorb ', '010930010', 'El3ezba el3arbya', 'open ', '', 'Muhammad.elnahtta', '2024-05-15 11:00:09', '01093001070', '2024-05-15 11:00:09', ''),
(5, 'Request', '1', 'kindly i need your advice', 'Zinab failed to absorb ', '010930010', 'El3ezba el3arbya', 'open ', '', 'Muhammad.elnahtta', '2024-05-15 11:00:09', '01093001070', '2024-05-15 11:00:09', ''),
(6, 'Request', '1', 'kindly i need your advice', 'Zinab failed to absorb ', '010930010', 'El3ezba el3arbya', 'open ', '', 'Muhammad.elnahtta', '2024-05-15 11:00:09', '01093001070', '2024-05-15 11:00:09', '');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `userId` int(11) NOT NULL,
  `name` varchar(250) NOT NULL,
  `username` varchar(250) NOT NULL,
  `secureH` varchar(250) NOT NULL,
  `password` varchar(250) NOT NULL,
  `companyId` varchar(250) NOT NULL,
  `user_role_id` int(11) NOT NULL DEFAULT 1,
  `userType` varchar(1) NOT NULL DEFAULT 'C',
  `systemtype` varchar(250) NOT NULL DEFAULT 'web',
  `gui_language` int(11) NOT NULL DEFAULT 1,
  `gui_theme` int(11) NOT NULL DEFAULT 1,
  `Status` varchar(1) NOT NULL DEFAULT 'A',
  `creationDate` datetime NOT NULL DEFAULT current_timestamp(),
  `createdBy` varchar(250) NOT NULL,
  `client_id` int(18) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`userId`, `name`, `username`, `secureH`, `password`, `companyId`, `user_role_id`, `userType`, `systemtype`, `gui_language`, `gui_theme`, `Status`, `creationDate`, `createdBy`, `client_id`) VALUES
(1, 'Eng Muhammad ElNahtta', 'muhammad.elnahtta', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '5f4dcc3b5aa765d61d8327deb882cf99', '1', 2, 'P', 'web', 1, 1, 'A', '2023-12-07 09:22:14', 'Muhammad.AlNahtta', 20758),
(9, 'admin', 'Administrator', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '5f4dcc3b5aa765d61d8327deb882cf99', '1', 2, 'P', 'web', 1, 1, 'A', '2023-12-07 09:22:14', 'Muhammad.AlNahtta', 0),
(13, 'Muhammad Soliman', 'Muhammad.Soliman', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '5f4dcc3b5aa765d61d8327deb882cf99', '1', 3, 'P', 'web', 1, 1, 'I', '2023-12-07 09:22:14', 'Muhammad.AlNahtta', 0),
(14, 'Nabile', 'Nabile', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '5f4dcc3b5aa765d61d8327deb882cf99', '1', 3, 'P', 'web', 1, 1, 'A', '2023-12-07 09:22:14', 'Muhammad.AlNahtta', 20758),
(215, 'full name', 'user.name', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '5f4dcc3b5aa765d61d8327deb882cf99', '1', 6, 'C', 'web', 1, 1, 'A', '2024-05-10 23:28:57', 'muhammad.elnahtta', 21958),
(216, 'Ahmed Abdullah El Nahtta', 'ahmed.alnahtta', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '5f4dcc3b5aa765d61d8327deb882cf99', '1', 3, 'C', 'web', 1, 1, 'A', '2024-05-11 00:27:40', 'muhammad.elnahtta', 21444),
(218, 'ahmed hisham', 'ahmed.hisham', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '5f4dcc3b5aa765d61d8327deb882cf99', '1', 3, 'C', 'web', 1, 1, 'I', '2024-05-11 00:30:56', 'muhammad.elnahtta', 20758);

-- --------------------------------------------------------

--
-- Table structure for table `users_blocked`
--

CREATE TABLE `users_blocked` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `systemtype` varchar(250) NOT NULL,
  `IP` varchar(255) NOT NULL,
  `blockDate` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users_blocked`
--

INSERT INTO `users_blocked` (`id`, `username`, `systemtype`, `IP`, `blockDate`) VALUES
(32, 'Nabile', 'web', '127.0.0.1', '2023-12-07 12:47:09');

-- --------------------------------------------------------

--
-- Table structure for table `users_login_sessions`
--

CREATE TABLE `users_login_sessions` (
  `id` int(11) NOT NULL,
  `username` varchar(250) NOT NULL,
  `systemtype` varchar(250) NOT NULL,
  `token` varchar(250) NOT NULL,
  `loginTme` datetime DEFAULT NULL,
  `logOutTime` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `users_login_sessions`
--

INSERT INTO `users_login_sessions` (`id`, `username`, `systemtype`, `token`, `loginTme`, `logOutTime`) VALUES
(449, 'muhammad.elnahtta', 'web', 'ab6ad9a86d1fac4f700f7865d106fba4nTc0C6wLHQea73e0311a94086158046acc045c4eeb6c66ad6f', '2023-12-07 03:51:37', '2023-12-07 08:23:32'),
(450, 'muhammad.elnahtta', 'web', 'd926447a7de96acc9575891b7b968775HtSY7q8LHS1078b7911876f8f2ad348d43628dfb03a6277782', '2023-12-07 08:23:34', '2023-12-07 10:15:57'),
(451, 'muhammad.elnahtta', 'web', '6c691bbd19afb9e71a72af9f0c4a768aAG5NNZY2v9dead138d169fcf194796ab071c3e4ca810ef8377', '2023-12-07 10:19:57', '2023-12-07 10:26:34'),
(452, 'muhammad.elnahtta', 'web', '39685b4975f08a331726bfd4ab239eccTvRmUnWDSt8357017cc9f4a9307aef74b06a4d4c41acf680b0', '2023-12-07 10:28:23', '2023-12-07 10:30:10'),
(453, 'muhammad.elnahtta', 'web', '5623bc150519d810db34d81ca1954ffeNOCeukvkQ97a252ede82489f0992f866dfb3b6a63788363cff', '2023-12-07 11:34:47', '2023-12-07 11:44:43'),
(454, 'muhammad.elnahtta', 'web', '1a86f1006c8f6807589b145778c92621cHyAKk3cdR43f8a88674571a3e3daa92ee13d4d9b894bd792d', '2023-12-07 11:36:53', '2023-12-07 11:55:03'),
(455, 'muhammad.elnahtta', 'web', '4c7c4d0313e23d211302359c39880f7dEZahriNHAV938b53b324bf4df53a0be6d2cabbf228590595fa', '2023-12-07 11:54:54', '2023-12-07 12:46:20'),
(456, 'muhammad.elnahtta', 'web', '43da96d3ba256d9377c1bcf213b044b4oHmXYFbXzD83f5d2b15ad14f92b1d54ad3cb8b5464bb3cb158', '2023-12-07 12:57:18', '2023-12-11 11:36:43'),
(457, 'muhammad.elnahtta', 'web', 'aea110ac8a0e1b5e1544f6a855144ddeAIzylJAFJ0a5af4bc44da4232213c3d1dae8722b1299fa7fb7', '2023-12-11 11:36:38', '2023-12-24 13:56:02'),
(458, 'muhammad.elnahtta', 'web', 'a208d0b88042cea2e8ef27588aeb672dZDnSQxumZK7faaf706666f95ccab28fcee205a06cad7b627cc', '2023-12-24 13:55:57', '2024-02-11 18:45:12'),
(459, 'muhammad.soliman', 'web', '37282aede68ed107107e1937d8950e4bMuotE9vrDu1969cab8734441a91991f9d9158f9bb82b6bf985', '2024-02-11 18:43:39', NULL),
(460, 'administrator', 'web', '5569fd9d4854f75893277ba5133594a7OYPx8M4B9b87a30a5cafd08aab22dc1893f55098d80880ed72', '2024-02-11 18:45:39', '2024-02-11 18:48:42'),
(461, 'muhammad.elnahtta', 'web', '7a0fa4d61f9871382f2e2e017d57ce2dgEBmkjqwaped70c753fcdb8596c3b68804870da41c6b65e6e2', '2024-02-11 18:48:56', '2024-02-21 03:19:52'),
(462, 'muhammad.elnahtta', 'web', 'f8745f2556243e396383c9cb45c8ba10YmyM6phm8Kc0ba33ed43068e89eb8c5d0fd6b203a9c98a103e', '2024-02-21 03:19:48', '2024-02-26 03:22:33'),
(463, 'muhammad.elnahtta', 'web', 'e8109e4d3e57a9acd66116e8bcec9c33lSSmcl1v7M8211af9a31a92ea5ea8c2b356d06af63288f58cb', '2024-02-26 03:22:26', '2024-02-28 16:04:57'),
(464, 'muhammad.elnahtta', 'web', '37ce22e926fbd6e4c607070ea89809909fRBzxjNot72e25cfdc827184f068ad233e7945a3d75fdfd86', '2024-02-28 16:05:16', '2024-04-25 05:26:33'),
(465, 'muhammad.elnahtta', 'web', 'ec39c25f196e1eb70520f130a9834a528LS9zmuXnL4066a1d73b19fed526f35bb51d618794218d0dcf', '2024-04-25 05:26:29', '2024-04-28 21:24:47'),
(466, 'muhammad.elnahtta', 'web', '65f42d8933111f66be0f045f475a28a9SeibZHcXkd96ca380232d255c6e433a54cc0655743c5dd9d9f', '2024-04-28 21:24:42', '2024-05-07 19:13:17'),
(467, 'muhammad.elnahtta', 'web', '6b8d47cc43c596a9d89763ff35a4e5d5xIP392hPup18b6a4e7edb8e004d9f604779b94037ea32a7911', '2024-05-07 19:13:11', '2024-05-07 19:27:11'),
(468, 'muhammad.elnahtta', 'web', 'f1c84e370fe4d04c0b116e7fa72abdb47WeTiA4EhQ784ee56a86795c4dc33d6b48fca90b6dfd1d8813', '2024-05-07 19:27:44', '2024-05-08 02:24:22'),
(469, 'muhammad.elnahtta', 'web', '7d4f3deac02d4b1836aeff4813e63910GXxrzVnP2Rcc18f0679e94900d8336ffc2b7f5debc567f38be', '2024-05-08 02:24:17', '2024-05-08 03:20:49'),
(470, 'muhammad.elnahtta', 'web', '65b58b392edba17bb009bc14d5c90c4dbreWGCDzjx777d160caae35071f30482d12581e98985d7cda2', '2024-05-08 03:20:45', '2024-05-09 03:47:16'),
(471, 'muhammad.elnahtta', 'web', '88788ab9c8e1a17186cb6925d6c990fbjRFKwlluegd4bc268d9abe8f2e273a7d4e65c79d7c875a717a', '2024-05-09 03:47:57', '2024-05-21 07:47:53'),
(472, 'muhammad.elnahtta', 'web', '2d991a056c8b6814dfd2fd8d4c84197fRXux13Bl1d63f7310b4dddb9c033923be869661d1984e4a69b', '2024-05-21 07:47:48', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `users_logs`
--

CREATE TABLE `users_logs` (
  `id` int(11) NOT NULL,
  `username` varchar(250) NOT NULL,
  `systemtype` varchar(250) NOT NULL,
  `userIP` varchar(250) NOT NULL,
  `action` varchar(250) NOT NULL,
  `description` longtext NOT NULL,
  `status` varchar(250) NOT NULL,
  `actionDateTime` datetime NOT NULL DEFAULT current_timestamp(),
  `userAgent` varchar(250) NOT NULL,
  `browserName` varchar(250) NOT NULL,
  `browserVersion` varchar(250) NOT NULL,
  `browserPlatform` varchar(250) NOT NULL,
  `browserPattern` varchar(250) NOT NULL,
  `actionApproval` varchar(250) NOT NULL DEFAULT 'Not Approved'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users_logs`
--

INSERT INTO `users_logs` (`id`, `username`, `systemtype`, `userIP`, `action`, `description`, `status`, `actionDateTime`, `userAgent`, `browserName`, `browserVersion`, `browserPlatform`, `browserPattern`, `actionApproval`) VALUES
(1190, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-07 03:51:37', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1191, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2023-12-07 03:51:41', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1192, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change theme', '', 'Success', '2023-12-07 08:07:47', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1193, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change theme', '', 'Success', '2023-12-07 08:07:58', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1194, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2023-12-07 08:08:06', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1195, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2023-12-07 08:20:55', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1196, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2023-12-07 08:21:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1197, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change user profile image', '', 'Success', '2023-12-07 08:23:31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1198, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-07 08:23:32', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1199, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-07 08:23:35', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1200, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2023-12-07 09:42:04', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1201, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2023-12-07 09:43:22', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1202, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2023-12-07 09:50:46', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1203, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2023-12-07 09:51:30', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1204, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-07 10:15:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1205, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 10:16:01', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1206, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 10:19:04', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1207, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-07 10:19:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1208, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change password', '', 'Success', '2023-12-07 10:26:00', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1209, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-07 10:26:34', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1210, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-07 10:28:24', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1211, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change password', '', 'Success', '2023-12-07 10:29:44', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1212, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-07 10:30:09', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1213, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-07 11:34:48', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1214, 'muhammad.elnahtta', 'web', '::1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 11:36:35', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36', 'Google Chrome', '119.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1215, 'muhammad.elnahtta', 'web', '::1', 'log in', '', 'Success', '2023-12-07 11:36:53', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36', 'Google Chrome', '119.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1216, 'muhammad.elnahtta', 'web', '::1', 'destroy other session token', '', 'Success', '2023-12-07 11:44:43', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36', 'Google Chrome', '119.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1217, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-07 11:44:52', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1218, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-07 11:54:55', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1219, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2023-12-07 11:55:03', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1220, 'muhammad.elnahtta', 'web', '::1', 'log out', '', 'Success', '2023-12-07 11:55:06', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36', 'Google Chrome', '119.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1221, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-07 12:46:19', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1222, 'nabile', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 12:46:30', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1223, 'nabile', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 12:46:38', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1224, 'nabile', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 12:46:45', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1225, 'nabile', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 12:46:54', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1226, 'nabile', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 12:47:01', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1227, 'System', 'web', '127.0.0.1', 'Block User', ' System Block User :Nabile due to 5 trials of falied login', 'Success', '2023-12-07 12:47:09', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1228, 'Nabile', 'web', '127.0.0.1', 'User Blocked', ' System Block User :Nabile due to 5 trials of falied login', 'Success', '2023-12-07 12:47:09', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1229, 'nabile', 'web', '127.0.0.1', 'log in', 'Account has been blocked', 'Failed', '2023-12-07 12:47:09', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1230, 'muhammad.elnahtta', 'web', '::1', 'log in', 'Wrong Password', 'Failed', '2023-12-07 12:57:09', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36', 'Google Chrome', '119.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1231, 'muhammad.elnahtta', 'web', '::1', 'log in', '', 'Success', '2023-12-07 12:57:18', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36', 'Google Chrome', '119.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1232, '', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-11 11:34:30', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1233, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-11 11:34:48', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1234, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-11 11:34:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1235, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', 'Wrong Password', 'Failed', '2023-12-11 11:36:17', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1236, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-11 11:36:39', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1237, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2023-12-11 11:36:43', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1238, 'super admin', 'web', '127.0.0.1', 'log out', '', 'Success', '2023-12-24 13:55:25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1239, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2023-12-24 13:55:58', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1240, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2023-12-24 13:56:02', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1241, 'Muhammad.Soliman', 'web', '::1', 'log in', '', 'Success', '2024-02-11 18:43:39', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.0.0 Safari/537.36', 'Google Chrome', '121.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1242, 'muhammad.soliman', 'web', '::1', 'change language', '', 'Success', '2024-02-11 18:44:06', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.0.0 Safari/537.36', 'Google Chrome', '121.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1243, 'muhammad.soliman', 'web', '::1', 'change language', '', 'Success', '2024-02-11 18:44:17', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.0.0 Safari/537.36', 'Google Chrome', '121.0.0.0', 'windows', '#(?<browser>Version|Chrome|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1244, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-02-11 18:45:12', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1245, '', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-02-11 18:45:22', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1246, 'Administrator', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-02-11 18:45:39', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1247, 'Administrator', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-02-11 18:48:42', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1248, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-02-11 18:48:56', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1249, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-02-21 03:15:24', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1250, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-02-21 03:19:48', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1251, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-02-21 03:19:52', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1252, '', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-02-26 03:18:37', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1253, '', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-02-26 03:18:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1254, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-02-26 03:22:27', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1255, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-02-26 03:22:33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1256, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-02-28 16:04:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1257, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-02-28 16:05:16', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1258, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2024-02-28 16:19:48', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1259, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2024-02-28 16:20:45', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1260, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2024-02-28 16:54:46', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1261, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2024-02-28 17:03:58', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1262, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2024-02-28 17:08:13', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1263, 'muhammad.elnahtta', 'web', '127.0.0.1', 'change language', '', 'Success', '2024-02-28 17:09:46', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1264, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-03-08 11:07:46', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1265, 'Raneen.mohamed', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-04-25 05:24:56', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1266, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-04-25 05:26:29', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1267, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-04-25 05:26:33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1268, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-04-28 21:24:42', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1269, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-04-28 21:24:47', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0', 'Mozilla Firefox', '119.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1270, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-05-07 19:13:12', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1271, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-05-07 19:13:17', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1272, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-05-07 19:27:11', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1273, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-05-07 19:27:44', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1274, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-05-08 02:24:17', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1275, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-05-08 02:24:22', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1276, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-05-08 03:17:36', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1277, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-05-08 03:20:45', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1278, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-05-08 03:20:49', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1279, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-05-09 03:47:15', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1280, '', 'web', '127.0.0.1', 'log out', '', 'Success', '2024-05-09 03:47:25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1281, 'nabile', 'web', '127.0.0.1', 'log in', 'Account has been blocked', 'Failed', '2024-05-09 03:47:32', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1282, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-05-09 03:47:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1283, '', '', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-09 16:37:07', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1284, 'muhammad.elnahtta', '', '127.0.0.1', 'Activate User ', ' Activated User  ', 'Success', '2024-05-09 16:37:08', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1285, '', '', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-09 16:37:32', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1286, 'muhammad.elnahtta', '', '127.0.0.1', 'Activate User ', ' Activated User  ', 'Success', '2024-05-09 16:37:32', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1287, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-09 16:38:41', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1288, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-09 16:38:41', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1289, 'nabile', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-09 16:41:35', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1290, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  nabile', 'Success', '2024-05-09 16:41:36', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1291, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-09 16:41:44', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1292, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-09 16:41:44', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1293, 'nabile', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-09 16:41:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1294, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  nabile', 'Success', '2024-05-09 16:41:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1295, 'nabile', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-09 16:42:16', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1296, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  nabile', 'Success', '2024-05-09 16:42:16', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1297, 'nabile', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-09 16:42:20', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1298, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  nabile', 'Success', '2024-05-09 16:42:20', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1299, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-09 16:42:22', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1300, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-09 16:42:22', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1301, 'nabile', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-09 20:38:29', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1302, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  nabile', 'Success', '2024-05-09 20:38:29', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1303, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-09 20:38:58', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1304, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-09 20:38:58', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1305, 'user.name', 'web', '127.0.0.1', ' User Created ', 'the User has been Created by ', 'Success', '2024-05-10 22:57:51', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1306, '', 'web', '127.0.0.1', 'Create User ', ' Create User:  user.name With Name: full name, Company ID: ,  User Group ID: 3, User Type: , and System Type: web', 'Success', '2024-05-10 22:57:51', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1307, 'user.name', 'web', '127.0.0.1', ' User Created ', 'the User has been Created by ', 'Success', '2024-05-10 23:28:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1308, '', 'web', '127.0.0.1', 'Create User ', ' Create User:  user.name With Name: full name, Company ID: ,  User Group ID: 6, User Type: , and System Type: web', 'Success', '2024-05-10 23:28:57', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1309, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:50:33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1310, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:50:33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1311, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:51:14', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1312, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:51:14', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1313, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:51:51', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1314, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:51:51', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1315, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:52:25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1316, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:52:25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1317, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:53:32', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1318, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:53:32', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1319, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:53:48', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1320, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:53:48', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1321, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:54:11', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1322, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:54:12', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1323, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:54:22', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1324, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:54:23', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1325, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:54:26', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1326, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:54:26', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1327, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:54:28', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1328, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:54:28', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1329, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:55:05', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1330, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:55:05', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1331, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:55:08', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1332, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:55:08', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1333, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:59:15', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1334, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:59:15', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1335, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-10 23:59:19', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1336, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-10 23:59:19', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1337, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:00:11', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1338, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-11 00:00:11', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1339, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:03:16', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1340, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-11 00:03:16', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1341, 'snabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:09:33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved');
INSERT INTO `users_logs` (`id`, `username`, `systemtype`, `userIP`, `action`, `description`, `status`, `actionDateTime`, `userAgent`, `browserName`, `browserVersion`, `browserPlatform`, `browserPattern`, `actionApproval`) VALUES
(1342, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  snabile', 'Success', '2024-05-11 00:09:33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1343, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:14:25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1344, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-11 00:14:26', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1345, 'nabile', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-11 00:23:27', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1346, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  nabile', 'Success', '2024-05-11 00:23:28', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1347, 'user.name', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-11 00:23:34', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1348, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  user.name', 'Success', '2024-05-11 00:23:34', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1349, 'user.name', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:23:39', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1350, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  user.name', 'Success', '2024-05-11 00:23:39', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1351, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:25:53', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1352, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-11 00:25:53', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1353, 'user.name', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-11 00:25:56', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1354, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  user.name', 'Success', '2024-05-11 00:25:56', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1355, 'nabile', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-11 00:25:59', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1356, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  nabile', 'Success', '2024-05-11 00:25:59', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1357, 'nabile', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:26:02', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1358, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  nabile', 'Success', '2024-05-11 00:26:02', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1359, 'user.name', 'web', '127.0.0.1', ' User Activated ', 'the User has been activated by muhammad.elnahtta', 'Success', '2024-05-11 00:26:05', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1360, 'muhammad.elnahtta', 'web', '127.0.0.1', 'Activate User ', ' Activated User  user.name', 'Success', '2024-05-11 00:26:05', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1361, 'ahmed.alnahtta', 'web', '127.0.0.1', ' User Created ', 'the User has been Created by ', 'Success', '2024-05-11 00:27:41', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1362, '', 'web', '127.0.0.1', 'Create User ', ' Create User:  ahmed.alnahtta With Name: Ahmed Abdullah El Nahtta, Company ID: ,  User Group ID: 3, User Type: , and System Type: web', 'Success', '2024-05-11 00:27:41', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1363, 'ahmed.hisham', 'web', '127.0.0.1', ' User Created ', 'the User has been Created by ', 'Success', '2024-05-11 00:29:44', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1364, '', 'web', '127.0.0.1', 'Create User ', ' Create User:  ahmed.hisham With Name: ahmed hisham, Company ID: ,  User Group ID: 3, User Type: , and System Type: web', 'Success', '2024-05-11 00:29:44', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1365, 'ahmed.hisham', 'web', '127.0.0.1', ' User Created ', 'the User has been Created by ', 'Success', '2024-05-11 00:30:56', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1366, '', 'web', '127.0.0.1', 'Create User ', ' Create User:  ahmed.hisham With Name: ahmed hisham, Company ID: ,  User Group ID: 3, User Type: , and System Type: web', 'Success', '2024-05-11 00:30:56', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1367, 'ahmed.hisham', 'web', '127.0.0.1', ' user deactivated ', 'the User has been deactivated by muhammad.elnahtta', 'Success', '2024-05-11 00:31:03', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1368, 'muhammad.elnahtta', 'web', '127.0.0.1', 'dectivate user ', ' Deactivated User  ahmed.hisham', 'Success', '2024-05-11 00:31:03', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1369, 'muhammad.elnahtta', 'web', '127.0.0.1', 'log in', '', 'Success', '2024-05-21 07:47:48', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1370, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-05-21 07:47:53', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved'),
(1371, 'muhammad.elnahtta', 'web', '127.0.0.1', 'destroy other session token', '', 'Success', '2024-05-22 03:40:10', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0', 'Mozilla Firefox', '125.0', 'windows', '#(?<browser>Version|Firefox|other)[/ ]+(?<version>[0-9.|a-zA-Z.]*)#', 'Not Approved');

-- --------------------------------------------------------

--
-- Table structure for table `users_profiles`
--

CREATE TABLE `users_profiles` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `Profile_image` varchar(250) NOT NULL,
  `Job_Title` varchar(250) NOT NULL,
  `job_description` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users_profiles`
--

INSERT INTO `users_profiles` (`id`, `user_id`, `Profile_image`, `Job_Title`, `job_description`) VALUES
(1, 1, 'assets/images/User_profile_img/5a9fd0f10360264ccadf48177b961d00.jpg', 'Senior Software Developer', ''),
(2, 4, 'assets/images/User_profile_img/MarwaAwad.png', 'Software Developer', '');

-- --------------------------------------------------------

--
-- Table structure for table `user_role`
--

CREATE TABLE `user_role` (
  `id` int(11) NOT NULL,
  `name` varchar(250) NOT NULL,
  `description` varchar(250) NOT NULL,
  `status` enum('Active','Deactivate') NOT NULL DEFAULT 'Active',
  `creationDate` datetime NOT NULL DEFAULT current_timestamp(),
  `createdBy` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_role`
--

INSERT INTO `user_role` (`id`, `name`, `description`, `status`, `creationDate`, `createdBy`) VALUES
(1, 'Forbidden', 'Forbidden', 'Active', '2022-08-15 11:28:28', 'Muhammad El Nahtta'),
(2, 'Admin', 'Admin', 'Active', '2022-05-23 15:31:42', 'Muhammad El Nahtta'),
(3, 'Sales Team', 'Sales Support Team', 'Active', '2022-05-23 15:32:33', 'Muhammad El Nahtta'),
(6, 'client', 'client', 'Active', '2023-12-24 17:09:16', 'Muhammad El Nahtta');

-- --------------------------------------------------------

--
-- Table structure for table `user_role_module_menu`
--

CREATE TABLE `user_role_module_menu` (
  `user_role_id` int(11) NOT NULL,
  `module_menu_id` varchar(250) NOT NULL,
  `access_type` enum('read','write') NOT NULL DEFAULT 'read'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_role_module_menu`
--

INSERT INTO `user_role_module_menu` (`user_role_id`, `module_menu_id`, `access_type`) VALUES
(1, 'Access Denied', 'write'),
(2, 'Blocked Users', 'write'),
(2, 'Change language', 'write'),
(2, 'Change Password', 'write'),
(2, 'Change Profile Image', 'write'),
(2, 'Change theme', 'write'),
(2, 'Client Registration', 'write'),
(2, 'Commission System', 'write'),
(2, 'Configuration', 'read'),
(2, 'Dashboard', 'write'),
(2, 'Dues', 'read'),
(2, 'Employee Commission', 'write'),
(2, 'log Management', 'write'),
(2, 'Login History', 'write'),
(2, 'Paid Values', 'write'),
(2, 'Payment Reports', 'write'),
(2, 'Reset User Password', 'write'),
(2, 'Review Payments', 'write'),
(2, 'Security', 'write'),
(2, 'Setting', 'write'),
(2, 'Sold Units', 'read'),
(2, 'Support', 'write'),
(2, 'System Administration', 'write'),
(2, 'Tickets', 'read'),
(2, 'User Management', 'write'),
(2, 'Users Activity Logs', 'write'),
(3, 'Change language', 'write'),
(3, 'Change Password', 'write'),
(3, 'Change Profile Image', 'write'),
(3, 'Change theme', 'write'),
(3, 'Client Registration', 'write'),
(3, 'Commission System', 'read'),
(3, 'Configuration', 'read'),
(3, 'Dashboard', 'write'),
(3, 'Dues', 'read'),
(3, 'Employee Commission', 'read'),
(3, 'log Management', 'write'),
(3, 'Login History', 'write'),
(3, 'Paid Values', 'read'),
(3, 'Payment Reports', 'write'),
(3, 'Review Payments', 'write'),
(3, 'Setting', 'write'),
(3, 'Sold Units', 'read'),
(3, 'Support', 'write'),
(3, 'System Administration', 'read'),
(3, 'Tickets', 'write'),
(3, 'User Management', 'write'),
(6, 'Change language', 'read'),
(6, 'Change Password', 'read'),
(6, 'Change Profile Image', 'read'),
(6, 'Change theme', 'read'),
(6, 'Dashboard', 'read'),
(6, 'Dues', 'read'),
(6, 'log Management', 'read'),
(6, 'Login History', 'read'),
(6, 'Paid Values', 'read'),
(6, 'Payment Reports', 'write'),
(6, 'Review Payments', 'read'),
(6, 'Setting', 'read'),
(6, 'Support', 'write'),
(6, 'Tickets', 'read');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `client_user`
--
ALTER TABLE `client_user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `national_ID` (`national_ID`);

--
-- Indexes for table `gui_lanuage`
--
ALTER TABLE `gui_lanuage`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `gui_theme`
--
ALTER TABLE `gui_theme`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `leaveamessage`
--
ALTER TABLE `leaveamessage`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `module_menu`
--
ALTER TABLE `module_menu`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `support_tickets`
--
ALTER TABLE `support_tickets`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`userId`);

--
-- Indexes for table `users_blocked`
--
ALTER TABLE `users_blocked`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_login_sessions`
--
ALTER TABLE `users_login_sessions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_logs`
--
ALTER TABLE `users_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_profiles`
--
ALTER TABLE `users_profiles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_role`
--
ALTER TABLE `user_role`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_role_module_menu`
--
ALTER TABLE `user_role_module_menu`
  ADD PRIMARY KEY (`user_role_id`,`module_menu_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `client_user`
--
ALTER TABLE `client_user`
  MODIFY `id` int(18) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22061;

--
-- AUTO_INCREMENT for table `gui_lanuage`
--
ALTER TABLE `gui_lanuage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `gui_theme`
--
ALTER TABLE `gui_theme`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `leaveamessage`
--
ALTER TABLE `leaveamessage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `support_tickets`
--
ALTER TABLE `support_tickets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `userId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=219;

--
-- AUTO_INCREMENT for table `users_blocked`
--
ALTER TABLE `users_blocked`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `users_login_sessions`
--
ALTER TABLE `users_login_sessions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=473;

--
-- AUTO_INCREMENT for table `users_logs`
--
ALTER TABLE `users_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1372;

--
-- AUTO_INCREMENT for table `users_profiles`
--
ALTER TABLE `users_profiles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `user_role`
--
ALTER TABLE `user_role`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
