<?php
/////////////////////////////////////////////////////////////////////////////////
// Powered by ENG Muhammad Abdullah El Nahtta 
// This module created from scratch by Powered by ENG Muhammad Abdullah El Nahtta
// Powered by ENG Muhammad Abdullah El Nahtta 
/////////////////////////////////////////////////////////////////////////////////
// you can contact me through mobile number 201093001070 or lanline 20 48 2327352
/////////////////////////////////////////////////////////////////////////////////
//                             &&&&&&&&&&&&&&&&,@                             
//                           &&&&&&&&&&&&&&&&&@&&&%&%                          
//                         *%&%&&%%%%#%%%%%%&%&&&&&&&                          
//                         &&&/,,,,,,...*,*,,***//(&&&%                        
//                       %&%&,,.....,,,,,,,,,,****//%&&                        
//                       %%#*,..... .........,,,,***/#&&                       
//                       &#*...........,...,,,,,,,****%&                       
//                       %(,....,...,......,,,###((***/&&*                     
//                     ..,#*,&#/,****@&*,,%/((#((/((*@#*,*                     
//                     .,..,@,,*(.&@(/,/.,@/((((*//*,*%**/                     
//                       ,,(,/..,,**,./..,**@,**,%&***//*                      
//                        .(,....,,,.....,******,,,,*/#,.                      
//                          (....,(...*..,*//***/#*//%                         
//                          %#,,//#(///((((#*//%%&/(%&                         
//                           #/#/*(..,,,,*,*//**#/%&&.                         
//                            /%#*/,...,,///****#&&&                           
//                             ,*%%#/(*//#(###%&&#/*,                          
//                            ,&..*/&&%&&&&&&&&#***,.&&                        
//                          @%   (....,,*///*****,  ..&&&&&&&&&&@              
//                     &&&&&%%%     *...,,,*,,,    ...&&&&&&&&&&&&&&&&&&&&&    
//             &%%%%%%%&&&%%%%%         ,,,,        .,&&&&&&&&&&&&&&&&&&&&&&&&&
//       %%%&&&%%%%%%%%%%&%%%%%%      @&#%%&&&&%  ...,&&&&&&&%&&&&%%%&&%&&&&&&&
//    %&&&%%%%%%%###%%%#%%%%%%%.     ,(/%#&&&&,.,# ...(&&&&&&&%&&&%%%%%%%%%%%&&
//    %%%%%%%#######%####%%%%%%%   ... *%#&&&,....   .*&&&&%&%%&&&&&%%%%%%%%%&&
//    %%################%%%%%%%&.        %%%&,....    /&&&%&%%%%&&&&&%%%%&&%&&%
//    %%###(#(((#(#(####%%%%%%%&,       %%%&&&...     .&&&&%%%%%&&&&&&&&&&&&&&&
/////////////////////////////////////////////////////////////////////////////////
// you can contact me through mobile number 201093001070 or lanline 20 48 2327352
/////////////////////////////////////////////////////////////////////////////////
// Powered by ENG Muhammad Abdullah El Nahtta 
// This module created from scratch by Powered by ENG Muhammad Abdullah El Nahtta
// Powered by ENG Muhammad Abdullah El Nahtta 
/////////////////////////////////////////////////////////////////////////////////
$lang['Data Export'] = 'إستخراج البيانات';
$lang['Export data to Copy, CSV, Excel, PDF & Print']='إستخراج البيانات إلى Copy و CSV و Excel و PDF & Print';
$lang['System Administration']='إدارة النظام';
$lang['Security']='الحماية';
$lang['Blocked Users']='المستخدمين محجوبين';

$lang['ID']='بطاقة تعريف';
$lang['User Name']='اسم المستخدم';
$lang['Access Type']='نوع الوصول';
$lang['IP']='بروتوكول إنترنت';
$lang['Block Date']='تاريخ الحظر';
$lang['view']='فحص';

$lang['Remove Block for User']='إزالة الحظر للمستخدم';
$lang['action']='العملية';
$lang['Date']='التاريخ';
$lang['Platform']='نوع النظام';
$lang['Status']='الحالة';
$lang['User has been unblocked.  Thanks for trusting US....... Software Development Team']='تم إلغاء حظر المستخدم. شكرا لثقتكم بنا ....... فريق تطوير البرمجيات ';

$lang['failed to unblock user please contact your Developer if the problem repeated']='فشل في إلغاء حظر المستخدم ، يرجى الاتصال بالمطور الخاص بك إذا تكررت المشكلة';
$lang['Check']='فحص';


$lang['name']='الإسم';
$lang['user name']='إسم المستخدم';
$lang['user role']='دور المستخدم';
$lang['creation date']='تاريخ الإنشاء';
$lang['created by']='انشأ من قبل';
$lang['client id']='رقم العميل';
$lang['user type']='نوع المستخدم';
$lang['access type']='نوع الوصول';
$lang['Status']='الحالة';
$lang['Action']='إجراء';

?>