<?php
/////////////////////////////////////////////////////////////////////////////////
// Powered by ENG Muhammad Abdullah El Nahtta 
// This module created from scratch by Powered by ENG Muhammad Abdullah El Nahtta
// Powered by ENG Muhammad Abdullah El Nahtta 
/////////////////////////////////////////////////////////////////////////////////
// you can contact me through mobile number 201093001070 or lanline 20 48 2327352
/////////////////////////////////////////////////////////////////////////////////
//                             &&&&&&&&&&&&&&&&,@                             
//                           &&&&&&&&&&&&&&&&&@&&&%&%                          
//                         *%&%&&%%%%#%%%%%%&%&&&&&&&                          
//                         &&&/,,,,,,...*,*,,***//(&&&%                        
//                       %&%&,,.....,,,,,,,,,,****//%&&                        
//                       %%#*,..... .........,,,,***/#&&                       
//                       &#*...........,...,,,,,,,****%&                       
//                       %(,....,...,......,,,###((***/&&*                     
//                     ..,#*,&#/,****@&*,,%/((#((/((*@#*,*                     
//                     .,..,@,,*(.&@(/,/.,@/((((*//*,*%**/                     
//                       ,,(,/..,,**,./..,**@,**,%&***//*                      
//                        .(,....,,,.....,******,,,,*/#,.                      
//                          (....,(...*..,*//***/#*//%                         
//                          %#,,//#(///((((#*//%%&/(%&                         
//                           #/#/*(..,,,,*,*//**#/%&&.                         
//                            /%#*/,...,,///****#&&&                           
//                             ,*%%#/(*//#(###%&&#/*,                          
//                            ,&..*/&&%&&&&&&&&#***,.&&                        
//                          @%   (....,,*///*****,  ..&&&&&&&&&&@              
//                     &&&&&%%%     *...,,,*,,,    ...&&&&&&&&&&&&&&&&&&&&&    
//             &%%%%%%%&&&%%%%%         ,,,,        .,&&&&&&&&&&&&&&&&&&&&&&&&&
//       %%%&&&%%%%%%%%%%&%%%%%%      @&#%%&&&&%  ...,&&&&&&&%&&&&%%%&&%&&&&&&&
//    %&&&%%%%%%%###%%%#%%%%%%%.     ,(/%#&&&&,.,# ...(&&&&&&&%&&&%%%%%%%%%%%&&
//    %%%%%%%#######%####%%%%%%%   ... *%#&&&,....   .*&&&&%&%%&&&&&%%%%%%%%%&&
//    %%################%%%%%%%&.        %%%&,....    /&&&%&%%%%&&&&&%%%%&&%&&%
//    %%###(#(((#(#(####%%%%%%%&,       %%%&&&...     .&&&&%%%%%&&&&&&&&&&&&&&&
/////////////////////////////////////////////////////////////////////////////////
// you can contact me through mobile number 201093001070 or lanline 20 48 2327352
/////////////////////////////////////////////////////////////////////////////////
// Powered by ENG Muhammad Abdullah El Nahtta 
// This module created from scratch by Powered by ENG Muhammad Abdullah El Nahtta
// Powered by ENG Muhammad Abdullah El Nahtta 
/////////////////////////////////////////////////////////////////////////////////
$lang['Data Export'] = 'إستخراج البيانات';
$lang['Export data to Copy, CSV, Excel, PDF & Print'] = 'إستخراج البيانات المراد نسخها و CSV و Excel و PDF والطباعة';
$lang['Setting'] = 'الإعدادات';
$lang['Reset User Password']='إعادة تعيين كلمة المرور';

$lang['Name'] = 'الإسم';
$lang['User Name'] = 'اسم المستخدم';
$lang['Access Type'] = 'نوع الوصول';
$lang['Reset Password'] = 'إعادة تعيين كلمة المرور';
$lang['Company'] = ' الشركة';

$lang['Reset user password'] = 'إعادة تعيين كلمة مرور المستخدم';

$lang['User Name'] = 'إسم المستخدم';
$lang['Access Type'] = 'نوع الوصول';
$lang['Company'] = 'الشركة';
$lang['New Password'] = 'كلمة المرور الجديدة';
$lang['Copy'] = 'نسخ';
$lang['Password Copied']='تم نسخ كلمة المرور';
$lang['User password has been reset.  Thanks for trusting US....... Software Development Team'] = 'تم إعادة تعيين كلمة مرور المستخدم. شكرا لثقتكم بنا ....... فريق تطوير البرمجيات ';
$lang['failed to rest user password please contact your Developer if the problem repeated'] = 'فشل في استعادة كلمة مرور المستخدم ، يرجى الاتصال بالمطور الخاص بك إذا تكررت المشكلة';
$lang['Regenerate']='تجديد';


?>